Revit 2027 API
Ceramic.CeramicColorByObject Property
 The property labeled "Color" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicColorByObject { get; }
Public Shared ReadOnly Property CeramicColorByObject As String
	Get
public:
static property String^ CeramicColorByObject {
	String^ get ();
}
static member CeramicColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace